Re10-unsteady/0.org/bedOfSpheres/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField     uniform 1.0;

boundaryField
{
    bedOfSpheres_to_fluid
    {
	 type  			fixedValue;
   	 value 			uniform 1.0;
	 /*
	 type           	compressible::turbulentTemperatureCoupledBaffleMixed;
         value           	400;
         neighbourFieldName 	T;
         kappa           	solidThermo;
         kappaName       	none;*/
    }
}

// ************************************************************************* //
