Re10-unsteady/0.org/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField     uniform 0.0;

boundaryField
{
    inlet
    {
	type  		fixedValue;
	value 		uniform 0.0;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
    }

    tubeWall
    {
        type            zeroGradient;
    }
 
    fluid_to_bedOfSpheres
    {
	 type  			fixedValue;
   	 value 			uniform 1.0;
	 /*type         	compressible::turbulentTemperatureCoupledBaffleMixed;
	 value          	1.0;
         neighbourFieldName 	T;
         kappa           	fluidThermo;
         kappaName       	none;*/
    }
}   

// ************************************************************************* //
