Re10-unsteady/0.org/fluid/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 -3 0 0 0 0 0];

internalField   uniform 1.2;

boundaryField
{
    inlet
    {
        type             fixedValue;
        value            uniform 1.2;
    }
    
    outlet
    {
        type             fixedValue;
        value            uniform 1.2;
    }
    
    fluid_to_bedOfSpheres
    {
        type             fixedValue;
        value            uniform 1.2;
    }

    tubeWall
    {
        type             fixedValue;
        value            uniform 1.2;
    }  
}   

// ************************************************************************* //
